console.log('number' + 3 + 3); // Результатом є: number33 - тут оператор + із рядком виконує конкатенацію, потім число 3 перетворюється на рядок.
console.log(null + 3); // Результатом є: 3 - тут спочатку null приводиться до 0, потім додається 3.
console.log(5 && "qwerty"); // Результатом є: qwerty - && повертає або перше false значення, або останнє true. Тут 5 це true, тому результатом стає другий операнд "qwerty".
console.log(+'40' + +'2' + "hillel"); // Результатом є: 42hillel - тут спочатку унарний + перетворює рядок у число: +'40' = 40, +'2' = 2. Потім виконується додавання 40 + 2 = 42, потім виконується конкатенація 42 + "hillel" і отримуємо 42hillel

console.log('10' - 5 === 6); // Результатом є: false - так як оператор - завжди числовий, то '10' перетворилося на number, потім від 10 відняли 5 = 5, і вже після цього порівняли 5 з 6 (порівнювали тип і значення), а це false
console.log(true + false); // Результатом є: 1 - тут true це 1, а false = 0, тому 1 + 0 = 1.
console.log('4px' - 3); // Результатом є: NaN - '4px' не може бути перетворено у число, тому дає NaN. NaN-3 буде NaN, тому що будь-яка арифметична дія з NaN дає NaN.
console.log('4' - 3); // Результатом є: 1 - тут рядок '4' перетворюється на число 4, потім звичайна аріфметичная дія 4 - 3 = 1.

console.log('6' + 3 ** 0); // Результатом є: 61 - тут спочатку степінь 3 ** 0 = 1, далі конкатенація та й отримуємо 61.
console.log(12 / '6'); // Результатом є: 2 - тут рядок '6' конвертується до number, потім вже 12/6 - 2. 
console.log('10' + (5 === 6)); // Результатом є: 10false - 5===6 це false, потім йде конкатенація та й отримуємо 10false.
console.log(null == ''); // Результатом є: false - null не може дорівнювати порожньому рядку (тільки undefined), тому тут false.

console.log(3 ** (9 / 3)); // Результатом є: 27 - тут спочатку виконується дія в дужках 9 / 3 = 3, потім в степінь 3 ** 3 = 27.
console.log(!!'false' == !!'true'); // Результатом є: true - будь-який непорожній рядок це тру, тому !!'false' - це все одно що !!true, де перший ! перетворює true на false, а другий ! перетворює знов на true. Аналогічно з !!'true' - це все одно що !!true, тож знов маємо після двух!! true. По ітогу маємо true == true і це таки тру.
console.log(0 || '0' && 1); // Результатом є: 1 - тут cпочатку дивимося на '0' && 1, тут '0' - це непорожній рядок, тому це тру, то ж беремо останній тру, а це у нас 1. Далі виконуємо 0 || 1, тут беремо перший тру, а це 1. 
console.log((+null == false) < 1); // Результатом є: false - +null це 0, 0==false це тру, а тру < 1 це неправильно, тому false. 

console.log(false && true || true); // Результатом є: true - тут спочатку дивимось на false && true і це = false, тому що коли &&, то має бути оба true, потім дивимось на false || true - тут вже беремо перший true. 
console.log(false && (false || true)); // Результатом є: false - тут спочатку дивимось на те, що в дужках (false || true ) - маємо тут true, далі дивимось на false && true, а це вже false, тому що коли &&, то має бути оба true.
console.log((+null == false) < 1 ** 5); // Результатом є: false - тут +null це 0, 1**5 це 1, 0 == false це true, true < 1 це неправильно, тому що 1 не може бути меньш ніж 1.
